app/controllers/creatures_controller.rb

  def index
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"  ORDER BY "creatures"."id" ASC

  def create
    creature_params = params.require(:creature).permit(:name, :description)

    taco = Creature.new(creature_params)
    creature
    if taco.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cookie Monster"], ["description", "Eats all teh cookies!!11!"], ["created_at", "2016-01-12 02:37:15.210473"], ["updated_at", "2016-01-12 02:37:15.210473"]]

  def show
    creature_id = params[:id]

    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 7]]

  def edit
    creature_id = params[:id]

    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature_params = params.require(:creature).permit(:name, :description)

    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "creatures"."id" = $4  [["name", "Trogdor2"], ["description", "The Burninator2!"], ["updated_at", "2016-01-21 19:49:35.474750"], ["id", 1]]

  def destroy
    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 2]]